#include <iostream>
#include <stdio.h>

using namespace std;

int main()
{
    float x, y, R = 2, R2 = 1; //R - радіус більшого кола, яке входить в штриховку; R2 - радіус меншого кола, яке не входить
    
    cout << "Введіть х:";
    cin >> x;
    cout << "Введіть y:";
    cin >> y;
    
    if(x > 0 && (x*x + y*y) <= (R*R) && (x*x + y*y) >= (R2*R2)){ //(х-х0)² + (у-у0)² <= R²; Формула для визначення чи входить точка в коло
        cout << "Точка входить в штриховку";       //Так як центр кола лежить на початку координат, формулу можна скоротити до x² + y² = R²
    }                                            //x² + y² >= R2²; Додаткова формула щоб виключити менше коло, яке входить в більше
    else{                                        //x > 0; Потрібне щоб виключити половину кола
        cout << "Точка не входить";
    }
}
